cos380-nlp.tex
% Created 2015-01-29 Thu 13:37
\documentclass{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{booktabs}
\usepackage[margin=1.5in]{geometry}
\usepackage{lastpage}
\usepackage{fancyhdr}
\pagestyle{fancy}
\lhead{COS 380---Natural Language Processing}
\chead{}
\rhead{Course Syllabus}
\lfoot{Spring 2015}
\cfoot{}
\rfoot{Page \thepage\ of \pageref{LastPage}}
\renewcommand{\headrulewidth}{0.4pt}
\renewcommand{\footrulewidth}{0.4pt}
\renewcommand\maketitle\relax
\date{Spring 2015}
\title{COS 380---Natural Language Processing}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.4.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle

\section{Instructor}
\label{sec-1}
\textbf{Dr. Tom Nurkkala}\\
Associate Professor, Computer Science and Engineering\\
Director, Center for Missions Computing\\
Office: Euler Science 211\\
E-Mail: \texttt{tnurkkala@cse.taylor.edu}\\
Phone: 765/998-5163\\
Hours: MW 2:00-4:00 or by appointment\\
\section{Course Overview}
\label{sec-2}
This course in Natural Language Processing (NLP) studies the automation of textual human
communication abilities. At the conclusion of this course, you will be familiar with
problems encountered in NLP as well as a variety of solutions currently in vogue. You will
have used standard software packages and will have written NLP software. You will also be
familiar with standard language processing applications and algorithms.
\section{Learning Objectives}
\label{sec-3}
The learning objectives for the course are as follows.
\begin{itemize}
\item Introduce you to the history and development of NLP.
\item Give you an understanding of the topics commonly included in NLP.
\item Stimulate your understanding of the algorithms used in carrying out text processing.
\item Stimulate your interest in NLP so that you will continue investigation after the course ends.
\item Develop in you an attitude of critical inquiry.
\item Provide a setting for scientific investigation \& experimentation.
\item Stimulate inter-disciplinary learning.
\item Practical, hands-on experience in NLP.
\item Stimulate development of programming competence in languages relevant to text processing.
\item Develop an awareness of the responsibilities a Christian has in the development of AI
capabilities, especially those in NLP.
\end{itemize}
\section{Possible Topics}
\label{sec-4}
NLP is a very large field. We will cover some (but not all) of the following topics.
\begin{itemize}
\item Regular expressions
\item Finite state automata
\item Finite state transducers
\item N-Grams
\item Part-of-speecth tagging
\item Hidden Markov Models
\item Formal Grammars of English
\item Syntactic Parsing
\item Statistical Parsing
\item Features and Unification
\item Representation of Meaning
\item Computational Semantics
\item Lexical Semantics
\item Computational Lexical Semantics
\item Computational Discourse
\item Information Extraction
\item Question Answering and Summarization
\item Machine Translation
\end{itemize}
\section{Required Texts}
\label{sec-5}
There are two texts required for the class. The standard textbook for the field is:
\begin{itemize}
\item Daniel Jurafsky and James Martin,
\emph{Speech and Language Processing}, Prentice Hall, 2009. ISBN 978-0-13-605234-0.
\end{itemize}
We will be using the Python-based Natural Language Toolkit,
which you can find at \url{http://nltk.org/}.
The NLTK and its latest documentation (\url{http://www.nltk.org/book/})
are open source and available freely on-line.

There is also a physical book about NLTK,
but it is now \emph{out of date} with the current version of the software.
However, if you prefer a physical book to on-line documentation,
much of the book is relevant.
Bibliographic details are:
\begin{itemize}
\item Steven Bird, Ewan Klein, and Edward Loper,
\emph{Natural Language Processing—Analyzing Text with Python and the Natural Language Toolkit},
O’Reilly Media, 2009. ISBN 978-0-596-51649-9.
\end{itemize}
\section{Moodle}
\label{sec-6}
The Computer Science and Engineering department uses Moodle as our Learning Management
System.
The URL for Moodle is \url{https://cms.cse.taylor.edu}.
To sign on to the course site for the first time, you will need an enrollment key.
The key for this course is \texttt{nerds4christ}.
You are responsible for checking Moodle regularly to keep up with assignment due dates
and other announcements posted to the site.
For due dates, the Moodle calendar is your friend.
\section{Classroom Expectations}
\label{sec-7}
Following are my expectations about classroom conduct.
\subsection{Attendance}
\label{sec-7-1}
Attendance is required. I will be in class each day, and I expect you to be there also. I
will log who attends each class session.

In general, I am very understanding about students who must miss class due to a sanctioned
Taylor activity, job interview, family emergency, and the like. If possible, let me know
in advance if you will not be in class. I will work with you to arrange make-up
instruction, homework, exams, etc.
\subsection{Conduct}
\label{sec-7-2}
I expect you to be prepared, awake, aware, and participatory during class. I will not
hesitate to ask you to stand or move if you are distracted or sleepy.

I expect you to join in discussions, respond to questions from me and from your
colleagues, and ask questions of me. I expect you to hold my feet to the fire if I am
being unclear, unkind, or contradictory.
\subsection{Gizmos}
\label{sec-7-3}
You may not use a laptop, tablet, or similar device to check e-mail, engage in social
networking, surf the web, or any other activity not directly relevant to current classroom
activity.

If you use an electronic gizmo during class for legitimate academic purposes (e.g., note
taking), be prepared to demonstrate relevant use on demand at any time.
\section{Evaluation}
\label{sec-8}
The grading breakdown will be as follows:
\begin{center}
\begin{tabular}{lr}
Deliverable & Weight\\
\hline
Homework & 25\%\\
Project & 25\%\\
Attendance and Participation & 10\%\\
Midterm & 20\%\\
Final & 20\%\\
\end{tabular}
\end{center}
Refer to the Periodic Table of the Grades (on Moodle) for my grading scheme. I reserve the
right to award a higher grade than strictly earned; outstanding attendance and class
participation figure prominently in such decisions.
\section{Academic Integrity}
\label{sec-9}
As a student at an institution whose goal is to honor Christ in all that it does,
I expect you to uphold the strictest standards of academic integrity.
You must do your own work, cite others when you present their work,
and never misrepresent your academic performance in any way.
Violation of these standards stains the reputations of you as a student,
Taylor as an institution,
and Jesus as our Lord.
Such a violation may result in your failing the course
and other disciplinary action by the University.
Refer to the Taylor catalog for the official statement of these ideas.
% Emacs 24.4.1 (Org mode 8.2.10)
\end{document}